// Создать цикл, который выводит числа от 1 до 10 включительно.

for (let i = 1; i <= 10; i++){
    console.log(i);
}

// Написать цикл, который выводит только четные числа от 1 до 20.

var mar = 1;
while (mar < 20){
    mar++
    if (mar % 2 == 0)
    console.log(mar)
};

// Реализовать цикл, который выводит таблицу умножения для числа 5.

    for (let g = 1; g <= 10; g++){
        console.log(5 * g);
    }
    
// Написать функцию, которая считает сумму всех чисел от 1 до 100.
let sum = 0;
for(let b = 1; b <= 100; b++){
    sum += b;
}
console.log(sum)