//1 Создайте переменную для хранения имени и присвойте ей значение вашего имени.
let user = 'Akhmed';
console.log(user)

// 2 Создайте переменную для хранения возраста и присвойте ей значение вашего возраста.
let age = 22;
console.log(age)

// 3 Создайте переменную для хранения булевого значения "true".
let b = true;
console.log(b)

// 4 Создайте переменную для хранения числа и присвойте ей любое число.
let number = 22321;
console.log(number)

// 5 Создайте переменную для хранения строки и присвойте ей любой текст.
let stroka = "prosto code";
console.log(stroka)

// 6 Создайте переменную для хранения значения "null".
let n = null;
console.log(n)

// 7 Создайте переменную для хранения значения "undefined".
var un = undefined;
console.log(un)



// Практика по операторам
// 1 Напишите код, который сравнивает два числа и выводит результат сравнения в консоль.
var num = (22 >= 2)
console.log(num)

// 2 Напишите код, который сравнивает две строки и выводит результат сравнения в консоль.
let s = ('Prosto' >= 'Kod')
console.log(s)

// 3 Напишите код, который сравнивает число и строку и выводит результат сравнения в консоль.
let k = ('Prosto' == 5000)
console.log(k)

// 4 Напишите код, который сравнивает два булевых значения и выводит результат сравнения в консоль.
let b2 = (Boolean(true) == Boolean(true));
console.log(b2)

// 5 Напишите код, который сравнивает две переменные, одна из которых содержит число, а другая - строку, и выводит результат сравнения в консоль.
let f = 4;
let l = 'Hello';
console.log(f == l)

// 6 Напишите код, который сравнивает две переменные, одна из которых содержит число, а другая - булево значение, и выводит результат сравнения в консоль.
let h = 24;
let bol = Boolean(false);
console.log(h > bol)
// Это задание не понял как сделать

//7 Напишите код, который сравнивает две переменные, одна из которых содержит строку, а другая - булево значение, и выводит результат сравнения в консоль.
let m = 'KOD'
let g = Boolean(true)
console.log(m >= g)

// Напишите код, который сравнивает две переменные, одна из которых содержит число, а другая - значение null, и выводит результат сравнения в консоль.
let c = 1;
let j = null;
console.log(c >= j)

// Напишите код, который сравнивает две переменные, одна из которых содержит значение undefined, а другая - булево значение, и выводит результат сравнения в консоль.
let u = undefined;
let r = Boolean(false);
console.log(u >= r)

// Напишите код, который сравнивает две переменные, одна из которых содержит значение null, а другая - значение undefined, и выводит результат сравнения в консоль.
let p = null;
let p2 = undefined;
console.log(p == p2)

